<!DOCTYPE HTML><html><head><meta charset="UTF-8"><meta content="text/html; charset=utf-8" http-equiv="Content-Type"><title>7.1 面向对象的简介 · GitBook</title><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="description" content=""><meta name="generator" content="GitBook 3.2.3"><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/style.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-prism/prism-okaidia.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-search-plus/search.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-fontsettings/website.css"><meta name="HandheldFriendly" content="true"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/images/favicon.ico" type="image/x-icon"><link rel="next" href="20170821_6.html"></head><body><div class="book"><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="Type to search"></div><nav role="navigation"><ul class="summary"><li class="chapter" data-level="1.1" data-path="../"><a href="../">Introduction</a></li><li class="divider"></li><li class="chapter" data-level="2.1"><span>第一章 VimL 语言主要特点</span><ul class="articles"><li class="chapter" data-level="2.1.1" data-path="20170816_2.html"><a href="20170816_2.html">1.1 Hello World 的四种写法</a></li><li class="chapter" data-level="2.1.2" data-path="20170816_3.html"><a href="20170816_3.html">1.2 同源 ex 命令行</a></li><li class="chapter" data-level="2.1.3" data-path="20170816_4.html"><a href="20170816_4.html">1.3 弱类型强作用域</a></li><li class="chapter" data-level="2.1.4" data-path="20170816_5.html"><a href="20170816_5.html">1.4* 自动加载脚本机制</a></li></ul></li><li class="chapter" data-level="2.2"><span>第二章 VimL 语言基本语法</span><ul class="articles"><li class="chapter" data-level="2.2.1" data-path="20170817_1.html"><a href="20170817_1.html">2.1 变量与类型</a></li><li class="chapter" data-level="2.2.2" data-path="20170817_2.html"><a href="20170817_2.html">2.2 选择与比较</a></li><li class="chapter" data-level="2.2.3" data-path="20170817_3.html"><a href="20170817_3.html">2.3 循环与迭代</a></li><li class="chapter" data-level="2.2.4" data-path="20170817_4.html"><a href="20170817_4.html">2.4 函数定义与使用</a></li><li class="chapter" data-level="2.2.5" data-path="20170817_5.html"><a href="20170817_5.html">2.5* 异常处理</a></li></ul></li><li class="chapter" data-level="2.3"><span>第三章 Vim 常用命令</span><ul class="articles"><li class="chapter" data-level="2.3.1" data-path="20170818_1.html"><a href="20170818_1.html">3.1 选项设置</a></li><li class="chapter" data-level="2.3.2" data-path="20170818_2.html"><a href="20170818_2.html">3.2 快捷键重映射</a></li><li class="chapter" data-level="2.3.3" data-path="20170818_3.html"><a href="20170818_3.html">3.3 自定义命令</a></li><li class="chapter" data-level="2.3.4" data-path="20170818_4.html"><a href="20170818_4.html">3.4 execute 与 normal</a></li><li class="chapter" data-level="2.3.5" data-path="20170818_5.html"><a href="20170818_5.html">3.5* 自动命令与事件</a></li><li class="chapter" data-level="2.3.6" data-path="20170818_6.html"><a href="20170818_6.html">3.6* 调试命令</a></li></ul></li><li class="divider"></li><li class="chapter" data-level="3.1"><span>第四章 VimL 数据结构进阶</span><ul class="articles"><li class="chapter" data-level="3.1.1" data-path="20170819_1.html"><a href="20170819_1.html">4.1 再谈列表与字符串</a></li><li class="chapter" data-level="3.1.2" data-path="20170819_2.html"><a href="20170819_2.html">4.2 通用的字典结构</a></li><li class="chapter" data-level="3.1.3" data-path="20170819_3.html"><a href="20170819_3.html">4.3 嵌套组合与扩展</a></li><li class="chapter" data-level="3.1.4" data-path="20170922_1.html"><a href="20170922_1.html">4.4* 正则表达式</a></li></ul></li><li class="chapter" data-level="3.2"><span>第五章 VimL 函数进阶</span><ul class="articles"><li class="chapter" data-level="3.2.1" data-path="20170819_4.html"><a href="20170819_4.html">5.1 可变参数</a></li><li class="chapter" data-level="3.2.2" data-path="20170819_5.html"><a href="20170819_5.html">5.2 函数引用</a></li><li class="chapter" data-level="3.2.3" data-path="20170819_6.html"><a href="20170819_6.html">5.3 字典函数</a></li><li class="chapter" data-level="3.2.4" data-path="20171023_1.html"><a href="20171023_1.html">5.4* 闭包函数</a></li><li class="chapter" data-level="3.2.5" data-path="20171028_1.html"><a href="20171028_1.html">5.5 自动函数</a></li></ul></li><li class="chapter" data-level="3.3"><span>第六章 VimL 内建函数使用</span><ul class="articles"><li class="chapter" data-level="3.3.1" data-path="20170821_1.html"><a href="20170821_1.html">6.1 操作数据类型</a></li><li class="chapter" data-level="3.3.2" data-path="20170821_2.html"><a href="20170821_2.html">6.2 操作编辑对象</a></li><li class="chapter" data-level="3.3.3" data-path="20170821_3.html"><a href="20170821_3.html">6.3 操作系统文件</a></li><li class="chapter" data-level="3.3.4" data-path="20170821_4.html"><a href="20170821_4.html">6.4 其他实用函数</a></li></ul></li><li class="chapter" data-level="3.4"><span>第七章 VimL 面向对象编程</span><ul class="articles"><li class="chapter active" data-level="3.4.1" data-path="20170821_5.html"><a href="20170821_5.html">7.1 面向对象的简介</a></li><li class="chapter" data-level="3.4.2" data-path="20170821_6.html"><a href="20170821_6.html">7.2 字典即对象</a></li><li class="chapter" data-level="3.4.3" data-path="20170821_7.html"><a href="20170821_7.html">7.3 自定义类的组织管理</a></li></ul></li><li class="divider"></li><li class="chapter" data-level="4.1"><span>第八章 VimL 异步编程特性</span><ul class="articles"><li class="chapter" data-level="4.1.1" data-path="20181121_1.html"><a href="20181121_1.html">8.1 异步工作简介</a></li><li class="chapter" data-level="4.1.2" data-path="20181205_1.html"><a href="20181205_1.html">8.2 使用异步任务</a></li><li class="chapter" data-level="4.1.3" data-path="20181210_1.html"><a href="20181210_1.html">8.3 使用通道控制任务</a></li><li class="chapter" data-level="4.1.4" data-path="20181212_1.html"><a href="20181212_1.html">8.4 使用配置内置终端</a></li></ul></li><li class="chapter" data-level="4.2"><span>第九章 VimL 混合编程</span><ul class="articles"><li class="chapter" data-level="4.2.1" data-path="20181215_1.html"><a href="20181215_1.html">9.1 用外部语言写过滤器</a></li><li class="chapter" data-level="4.2.2" data-path="20181215_2.html"><a href="20181215_2.html">9.2 外部语言接口编程</a></li><li class="chapter" data-level="4.2.3" data-path="20181217_2.html"><a href="20181217_2.html">9.3* Perl 语言接口开发</a></li></ul></li><li class="chapter" data-level="4.3"><span>第十章 Vim 插件管理与开发</span><ul class="articles"><li class="chapter" data-level="4.3.1" data-path="20181219_1.html"><a href="20181219_1.html">10.1 典型插件的目录规范</a></li><li class="chapter" data-level="4.3.2" data-path="20181219_2.html"><a href="20181219_2.html">10.2 插件管理器插件介绍</a></li><li class="chapter" data-level="4.3.3" data-path="20181219_3.html"><a href="20181219_3.html">10.3 插件开发流程指引</a></li></ul></li><li class="chapter" data-level="4.4"><span>结语</span></li><li class="divider"></li><li><a href="https://www.gitbook.com" target="blank" class="gitbook-link">Published with GitBook</a></li></ul></nav></div><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><h1><i class="fa fa-circle-o-notch fa-spin"></i> <a href="..">7.1 面向对象的简介</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div class="search-plus" id="book-search-results"><div class="search-noresults"><section class="normal markdown-section"><h1 id="&#x7B2C;&#x4E03;&#x7AE0;-viml-&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;">&#x7B2C;&#x4E03;&#x7AE0; VimL &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;</h1><p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF0C;&#x5E76;&#x4E0D;&#x7279;&#x6307;&#x67D0;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x5FC5;&#x60CA;&#x8BB6;&#x7528; VimL &#x4E5F;&#x80FD;&#x4EE5;&#x9762;&#x5411; &#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5199;&#x4EE3;&#x7801;&#x3002;&#x672C;&#x7AE0;&#x5148;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF0C;&#x518D;&#x63A2;&#x8BA8;&#x5982;&#x4F55;&#x5229;&#x7528; VimL &#x73B0;&#x6709;&#x7684;&#x7279;&#x6027;&#x5B9E;&#x73B0;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3002;&#x6700;&#x540E;&#x5E94;&#x7531;&#x7528;&#x6237;&#x81EA;&#x884C;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x98CE;&#x683C;&#x6765; &#x5199; VimL &#x811A;&#x672C;&#x3002;</p><h2 id="71-&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7B80;&#x4ECB;">7.1 &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7B80;&#x4ECB;</h2><p>&#x5728;&#x524D;&#x6587;&#x4E2D;&#x7528;&#x4E86;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x7BC7;&#x5E45;&#x6765;&#x4ECB;&#x7ECD;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x4E3B;&#x8981;&#x4EE5;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x5143;&#x6765;&#x7EC4;&#x7EC7;&#x7A0B;&#x5E8F;&#xFF08;&#x811A;&#x672C;&#xFF09; &#x4EE3;&#x7801;&#xFF0C;&#x51FD;&#x6570;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x8C03;&#x7528;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6216;&#x53EF;&#x79F0;&#x4E4B;&#x4E3A;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x7F16;&#x7A0B;&#x3002;&#x5927;&#x90E8; &#x5206;&#x7B80;&#x5355;&#x7684; VimL &#x811A;&#x672C;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x3002;&#x5355;&#x5143;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x4E0E;&#x590D;&#x7528;&#x4E5F;&#x7B97;&#x7B80;&#x6D01;&#x3002;</p><p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x66F4;&#x5927;&#x7684;&#x91CE;&#x5FC3;&#xFF0C;&#x60F3;&#x7528; VimL &#x5B9E;&#x73B0;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x53EA;&#x91C7;&#x7528;&#x4EE5;&#x4E0A;&#x57FA;&#x4E8E;&#x51FD;&#x6570;&#x7684;&#x9762; &#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x95F9;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x8FC7;&#x591A;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x5C0F;&#x5FC3;&#x5404;&#x53C2;&#x6570; &#x7684;&#x610F;&#x4E49;&#x4E0E;&#x6B21;&#x5E8F;&#xFF0C;&#x6216;&#x8BB8;&#x8FD8;&#x53EF;&#x80FD;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x8981;&#x5B9A;&#x4E49;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x81F3;&#x4E8E;&#x5F71; &#x54CD;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x7EF4;&#x62A4;&#x4EE3;&#x7801;&#x9020;&#x6210;&#x56F0;&#x6270;&#xFF0C;&#x589E;&#x52A0;&#x7A0B;&#x5E8F;&#x7EF4;&#x62A4;&#x4E0E;&#x590D;&#x7528;&#x7684;&#x56F0;&#x96BE;&#x3002;</p><p>&#x8FD9;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x8003;&#x8651;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x3002;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x6570;&#x636E;&#x4E0E;&#x51FD;&#x6570;&#x7684;&#x6574;&#x5408;&#x4E0E;&#x7EDF;&#x4E00;&#xFF0C;&#x4EE5;&#x66F4;&#x63A5;&#x8FD1; &#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x53BB;&#x5199;&#x4EE3;&#x7801;&#x4E0E;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x3002;</p><h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;</h3><p>&#x6309;&#x4E00;&#x4E9B;&#x8D44;&#x6599;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x5F81;&#xFF1A;</p><ul><li>&#x62BD;&#x8C61;</li><li>&#x5C01;&#x88C5;</li><li>&#x7EE7;&#x627F;</li><li>&#x591A;&#x6001;</li></ul><p>&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x90FD;&#x5E94;&#x8BE5;&#x4ECE;&#x62BD;&#x8C61;&#x5F00;&#x59CB;&#x3002;&#x5206;&#x6790;&#x73B0;&#x5B9E;&#x9700;&#x6C42;&#x95EE;&#x9898;&#x7684;&#x4E3B;&#x8981;&#x5173;&#x7CFB;&#xFF0C;&#x5F52;&#x7EB3;&#x51FA;&#x529F;&#x80FD;&#x5355;&#x5143; &#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x6309;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x8BBE;&#x8BA1;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x9700;&#x6C42;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x62BD;&#x8C61;&#x80FD;&#x529B;&#x3002;&#x6240;&#x4EE5;&#x4E5F;&#x6709;&#x4E9B; &#x6559;&#x7A0B;&#x8D44;&#x6599;&#x8BF4;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x662F;&#x540E;&#x9762;&#x8FD9;&#x4E09;&#x4E2A;&#xFF1A;&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x4E0E;&#x591A;&#x6001;&#x3002;&#x8FD9;&#x53C8;&#x6D89;&#x53CA;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684; &#x53E6;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6982;&#x5FF5;&#xFF0C;&#x7C7B;&#x3002;</p><p>&#x7C7B;&#x5C31;&#x662F;&#x5C06;&#x73B0;&#x5B9E;&#x8BF8;&#x95EE;&#x9898;&#x62BD;&#x8C61;&#x540E;&#x7684;&#x5C01;&#x88C5;&#x7ED3;&#x679C;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x64CD;&#x4F5C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x6982;&#x5FF5;&#x53CA; &#x8868;&#x73B0;&#x4E0A;&#x5C06;&#x8FD9;&#x4E24;&#x90E8;&#x5206;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x5C31;&#x79F0;&#x4E4B;&#x4E3A;&#x5C01;&#x88C5;&#x3002;&#x7C7B;&#x5F80;&#x5F80;&#x5BF9;&#x5E94;&#x7740;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x67D0;&#x79CD; &#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F53;&#x6216;&#x52A8;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x53EA;&#x7528;&#x5173;&#x6CE8;&#x67D0;&#x7C7B;&#x7269;&#x4E8B;&#x7684;&#x8868;&#x9762;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x5176;&#x5185;&#x90E8;&#x6784;&#x9020;&#x7EC6;&#x8282; &#x3002;&#x53CD;&#x6620;&#x5230;&#x7A0B;&#x5E8F;&#x4E0A;&#xFF0C;&#x7C7B;&#x7684;&#x5C01;&#x88C5;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#xFF0C;&#x7B80;&#x5316;&#x7528;&#x6CD5;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x6237;&#x53EA;&#x8981;&#x7406;&#x89E3;&#x67D0;&#x4E2A;&#x7C7B;&#x662F;&#x4EC0; &#x4E48;&#x6216;&#x50CF;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x5219;&#x4E0D;&#x7528;&#x6DF1;&#x7A76;&#x600E;&#x4E48;&#x505A;&#x3002;</p><p>&#x6240;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x7C7B;&#x4E0D;&#x5916;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x590D;&#x6742;&#x7C7B;&#x578B;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x7B80;&#x5355;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x5982;&#x6570;&#x5B57;&#x3001; &#x5B57;&#x7B26;&#x4E32;&#x8FD9;&#x79CD;&#x5728;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x90FD;&#x5185;&#x7F6E;&#x652F;&#x6301;&#x7684;&#x3002;&#x7B80;&#x5355;&#x7C7B;&#x578B;&#x9664;&#x4E86;&#x53EF;&#x4EE5;&#x7528;&#x503C;&#x8868;&#x793A;&#x4E00;&#x79CD;&#x610F;&#x4E49;&#x5916;&#xFF0C;&#x8FD8;&#x652F;&#x6301; &#x7279;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x6570;&#x5B57;&#x7684;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8054;&#x8FDE;&#x3001;&#x5206;&#x5272;&#x3001;&#x5339;&#x914D;&#x7B49;&#x3002;&#x7C7B;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x8868;&#x793A; &#x503C;&#x7684;&#x5C31;&#x662F;&#x88AB;&#x5C01;&#x88C5;&#xFF08;&#x53EF;&#x80FD;&#x591A;&#x4E2A;&#xFF09;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x6210;&#x5458;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x6240;&#x652F;&#x6301;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x4E5F;&#x53EB;&#x6210;&#x5458; &#x51FD;&#x6570;&#x3002;&#x800C;&#x5BF9;&#x8C61;&#x4E0E;&#x7C7B;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x6B63;&#x5982;&#x53D8;&#x91CF;&#x4E0E;&#x7C7B;&#x578B;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5BF9;&#x8C61;&#x662F;&#x5C5E;&#x4E8E;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x79F0;&#x5176;&#x4E3A; &#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;</p><p>&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8FD8;&#x5BF9;&#x7C7B;&#x7684;&#x5C01;&#x88C5;&#x8FDB;&#x884C;&#x4E86;&#x4E25;&#x683C;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x5916;&#x90E8;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x63D0; &#x4F9B;&#x7684;&#x6240;&#x8C13;&#x516C;&#x6709;&#x65B9;&#x6CD5;&#xFF08;&#x5C5E;&#x6027;&#xFF09;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#xFF08;&#x5C5E;&#x6027;&#xFF09;&#x53EA;&#x80FD;&#x5728;&#x7C7B;&#x5185;&#x90E8;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</p><p>&#x7EE7;&#x627F;&#x662F;&#x4E3A;&#x4E86;&#x62D3;&#x5C55;&#x5C01;&#x88C5;&#x4E4B;&#x540E;&#x7684;&#x7C7B;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x7528;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x590D;&#x7528;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x76F8; &#x5173;&#x7684;&#x7C7B;&#x4E2D;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x5177;&#x6709;&#x67D0;&#x79CD;&#x4ECE;&#x5C5E;&#x5173;&#x7CFB;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x3002;&#x5728;&#x88AB;&#x7EE7;&#x627F;&#x4E0E;&#x7EE7;&#x627F;&#x7684; &#x4E24;&#x7AEF;&#xFF0C;&#x4E00;&#x822C;&#x79F0;&#x4E4B;&#x4E3A;&#x57FA;&#x7C7B;&#x4E0E;&#x6D3E;&#x751F;&#x7C7B;&#xFF0C;&#x6216;&#x901A;&#x4FD7;&#x70B9;&#x53EB;&#x7236;&#x7C7B;&#x4E0E;&#x5B50;&#x7C7B;&#x3002;&#x5B50;&#x7C7B;&#x7EE7;&#x627F;&#x4E86;&#x7236;&#x7C7B;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5C5E;&#x6027; &#x4E0E;&#x65B9;&#x6CD5;&#xFF08;&#x5177;&#x4F53;&#x7684;&#x8BED;&#x8A00;&#x6216;&#x7531;&#x4E8E;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x53E6;&#x6709;&#x7EC6;&#x8282;&#x63A7;&#x5236;&#xFF09;&#xFF0C;&#x56E0;&#x800C;&#x53EF;&#x4EE5;&#x50CF;&#x64CD;&#x4F5C;&#x7236;&#x7C7B;&#x4E00;&#x6837;&#x64CD;&#x4F5C;&#x5B50;&#x7C7B; &#x3002;</p><p>&#x591A;&#x6001;&#x662F;&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x5B8C;&#x5584;&#x7EE7;&#x627F;&#x7684;&#x7528;&#x9014;&#x800C;&#x4F34;&#x751F;&#x7684;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x4E00;&#x7C07;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C; &#x8BF8;&#x6D3E;&#x751F;&#x7C7B;&#x5404;&#x5177;&#x4E2A;&#x6027;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4FDD;&#x7559;&#x5171;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x8BBF;&#x95EE;&#x63A5;&#x53E3;&#x3002;&#x5373;&#x5411;&#x8BB8;&#x591A;&#x5BF9;&#x8C61;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#x4F7F; &#x5176;&#x6267;&#x884C;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x5404;&#x5BF9;&#x8C61;&#x80FD;&#x4F9D;&#x636E;&#x5176;&#x7C7B;&#x578B;&#x4F5C;&#x4E0D;&#x540C;&#x7684;&#x54CD;&#x5E94;&#xFF08;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#xFF09;&#x3002;</p><h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x793A;&#x4F8B;&#x5206;&#x6790;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x793A;&#x4F8B;&#x5206;&#x6790;</h3><p>&#x5148;&#x4E3E;&#x4E2A;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5C31;&#x6BD4;&#x5982;&#x6570;&#x5B57;&#xFF0C;&#x4EC5;&#x7BA1;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x628A;&#x6570;&#x5B57;&#x5F53;&#x4F5C;&#x7B80;&#x5355;&#x7684;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x5374; &#x4E5F;&#x4E0D;&#x59A8;&#x7528;&#x7C7B;&#x4E0E;&#x5BF9;&#x8C61;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x601D;&#x8003;&#x8FD9;&#x4E2A;&#x5DF2;&#x7ECF;&#x88AB;&#x6570;&#x5B66;&#x62BD;&#x8C61;&#x8FC7;&#x7684;&#x6982;&#x5FF5;&#x3002;</p><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6570;&#x5B57;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF1A;&#x6574;&#x6570;&#x3001;&#x5B9E;&#x6570;&#x3001;&#x6709;&#x7406;&#x6570;&#x3001;&#x590D;&#x6570;&#x7B49;&#x3002;&#x6BCF;&#x79CD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x8FD8; &#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E4B;&#x4E0A;&#x518D;&#x62BD;&#x8C61;&#x51FA;&#x4E00;&#x79CD;&#x865A;&#x62DF;&#x7684;&#x201C;&#x6570;&#x5B57;&#x201D;&#x7C7B;&#xFF0C;&#x5F53;&#x4F5C;&#x8FD9;&#x4E9B;&#x6570;&#x7C7B;&#x7684;&#x7EDF;&#x4E00;&#x57FA;&#x7C7B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x7C07;&#x4E4B;&#x95F4;&#x5C31; &#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x3002;&#x51E1;&#x662F;&#x6570;&#x5B57;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x3002;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x53EA;&#x9700; &#x5BF9;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x8C03;&#x7528;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x5176;&#x662F;&#x54EA;&#x7C7B;&#x6570;&#xFF0C;&#x6BCF;&#x7C7B;&#x6570;&#x4F1A;&#x6309;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x76F8;&#x52A0;&#xFF08;&#x5982;&#x6709; &#x7406;&#x6570;&#x7684;&#x76F8;&#x52A0;&#x4E0E;&#x590D;&#x6570;&#x7684;&#x76F8;&#x52A0;&#x5C31;&#x6709;&#x663E;&#x8457;&#x4E0D;&#x540C;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E0A;&#x7684;&#x591A;&#x6001;&#x610F;&#x4E49;&#x3002;&#x6574;&#x6570;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x7528;&#x5C11; &#x6570;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x56DB;&#x6216;&#x516B;&#x5B57;&#x8282;&#xFF09;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6709;&#x65F6;&#x8981;&#x7528;&#x5230;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5355;&#x72EC;&#x518D;&#x5B9A; &#x4E49;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x5236;&#x7684;&#x5927;&#x6574;&#x6570;&#x7C7B;&#x3002;&#x4F46;&#x5BF9;&#x4E00;&#x822C;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x5927;&#x6574;&#x6570;&#x5728;&#x5E95;&#x5C42;&#x5982;&#x4F55;&#x8868;&#x793A;&#xFF0C;&#x53EA;&#x9700; &#x6309;&#x666E;&#x901A;&#x5C0F;&#x6574;&#x6570;&#x4E00;&#x6837;&#x4F7F;&#x7528;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5C01;&#x88C5;&#x7684;&#x4FBF;&#x5229;&#x6027;&#x3002;</p><p>&#x518D;&#x4E3E;&#x4E2A;&#x5207;&#x8FD1; Vim &#x4E3B;&#x9898;&#x7684;&#x4F8B;&#x5B50;&#x3002;Vim &#x662F;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x5904;&#x7406;&#x7684;&#x4E1A;&#x52A1;&#x5C31;&#x662F;&#x7EAF;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x3002; &#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x59A8;&#x5C06;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;&#x5176;&#x5B9E;&#x4ECE;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x6587;&#x4EF6;&#x5305;&#x62EC;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4E0E;&#x4E8C; &#x8FDB;&#x5236;&#x6587;&#x4EF6;&#xFF0C;&#x82E5;&#x6309;&#x201C;&#x4E00;&#x5207;&#x7686;&#x6587;&#x4EF6;&#x201D;&#x7684; linux &#x601D;&#x60F3;&#xFF0C;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x8BBE;&#x5907;&#x4E5F;&#x7B97;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4EE5; Vim &#x7684; &#x529F;&#x80FD;&#x76EE;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x4E0D;&#x5FC5;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x53EF;&#x6269;&#x5927;&#x5316;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5C31;&#x4ECE;&#x5B83;&#x80FD;&#x5904;&#x7406;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x5F00; &#x59CB;&#x5427;&#x3002;</p><p>Vim &#x5C06;&#x5B83;&#x80FD;&#x7F16;&#x8F91;&#x7684;&#x6587;&#x4EF6;&#x5206;&#x4E3A;&#x8BB8;&#x591A;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x5C31;&#x5982;&#x5404;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x3002;&#x4E8E;&#x662F; &#x6BCF;&#x79CD;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x89C6;&#x4E3A;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x8FD9;&#x4E2A;&#x201C;&#x57FA;&#x7C7B;&#x201D;&#x7684;&#x201C;&#x6D3E;&#x751F;&#x7C7B;&#x201D;&#x3002;&#x7136;&#x540E;&#xFF0C;Vim &#x6240;&#x5173;&#x6CE8;&#x7684;&#x53EA;&#x662F;&#x7F16;&#x8F91;&#x6E90; &#x7801;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x7F16;&#x8BD1;&#x6E90;&#x7801;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x8868;&#x9762;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x6216;&#x6587;&#x6CD5;&#xFF09;&#x7528;&#x4E8E;&#x7740;&#x8272;&#x3001;&#x7F29;&#x8FDB;&#x3001;&#x6298;&#x53E0;&#x7B49;&#x7F8E;&#x5316; &#x663E;&#x793A;&#x6216;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x59A8;&#x518D;&#x628A;&#x4E00;&#x4E9B;&#x201C;&#x8BED;&#x6CD5;&#x7C7B;&#x4F3C;&#x201D;&#x7684;&#x8BED;&#x8A00;&#x518D;&#x5F52;&#x4E3A;&#x540C;&#x4E00;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982; C/C++&#x3001; java&#x3001;C#&#x3001;javascript &#x7B49;&#xFF08;&#x90FD;&#x4EE5;&#x5927;&#x62EC;&#x53F7;&#x4F5C;&#x4E3A;&#x5C42;&#x6B21;&#x5B9A;&#x754C;&#x7B26;&#xFF09;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E0A;&#x518D;&#x62BD;&#x8C61;&#x4E00;&#x4E2A; <code>C-Family</code> &#x7684;&#x57FA;&#x7C7B;&#xFF0C;&#x5B83;&#x5904;&#x4E8E;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4E4B;&#x4E0B;&#xFF0C;&#x800C;&#x5728;&#x5404;&#x5177;&#x4F53;&#x7684;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x4E4B;&#x4E0A;&#x3002;&#x663E;&#x7136; &#xFF0C;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x4E0E;&#x8BBE;&#x8BA1;&#xFF0C;&#x662F;&#x4E0E;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x76EE;&#x6807;&#x6709;&#x5173;&#x7684;&#x3002;&#x82E5;&#x5728;&#x5176;&#x4ED6;&#x573A;&#x5408;&#xFF0C;&#x5C06; C++&#x3001;java&#x3001; javascript &#x7B49;&#x50BB;&#x50BB;&#x5206;&#x4E0D;&#x6E05;&#x6DF7;&#x4E3A;&#x4E00;&#x8C08;&#x5C31;&#x53EF;&#x80FD;&#x4E0D;&#x9002;&#x5408;&#x4E86;&#x3002;</p><p>&#x82E5;&#x518D;&#x7EE7;&#x7EED;&#x5206;&#x6790;&#xFF0C;C &#x8BED;&#x8A00;&#x4E0E; C++ &#x8BED;&#x8A00;&#x8FD8;&#x7B97;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x603B;&#x6709;&#x4E9B;&#x7EC6;&#x8282;&#x5DEE;&#x5F02;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5C24;&#x5176; &#x662F;&#x4EBA;&#x4E3A;&#x89C4;&#x5B9A;&#x7684;&#x6E90;&#x7801;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x95EE;&#x9898;&#x3002;&#x81F3;&#x4E8E;&#x662F;&#x5426;&#x771F;&#x8981;&#x518D;&#x7EC6;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7C7B;&#xFF0C;&#x90A3;&#x5F97;&#x770B;&#x9700;&#x6C42;&#x7684;&#x6743;&#x8861;&#x4E86;&#x3002; &#x53E6;&#x5916;&#xFF0C;C/C++ &#x8BED;&#x8A00;&#x8FD8;&#x6709;&#x4E2A;&#x7279;&#x522B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x8981;&#x5206;&#x4E3A;&#x5934;&#x6587;&#x4EF6;&#x4E0E;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E5F;&#x5F97;&#x770B;&#x9700;&#x6C42;&#x662F;&#x5426;&#x8981; &#x518D;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7C7B;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x5728;&#x7F16;&#x5199; C/C++ &#x4EE3;&#x7801;&#x65F6;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x5728;&#x5934;&#x6587;&#x4EF6;&#x58F0;&#x660E;&#x4E0E;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x7684;&#x5B9E; &#x73B0;&#x65F6;&#x6765;&#x56DE;&#x8DF3;&#x8F6C;&#xFF0C;&#x751A;&#x81F3;&#x60F3;&#x4FDD;&#x6301;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x7684;&#x987A;&#x5E8F;&#x4E0E;&#x5934;&#x6587;&#x4EF6;&#x58F0;&#x660E;&#x4E00;&#x81F4;&#x4EE5;&#x4FBF;&#x4E8E;&#x5BF9;&#x7167;&#x9605;&#x8BFB;&#xFF0C;&#x90A3;&#x4E48;&#x518D;&#x7EE7; &#x627F;&#x4E24;&#x4E2A;&#x7C7B;&#x5206;&#x522B;&#x8BBE;&#x8BA1;&#x6216;&#x8BB8;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5462;&#x3002;</p><p>&#x5BF9;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x6E90;&#x7801;&#x6587;&#x4EF6;&#xFF0C;Vim &#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7F29;&#x8FDB;&#x91CD;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x5373; <code>=</code> &#x547D;&#x4EE4;&#xFF09;&#x3002;&#x53EA; &#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x7C7B;&#x5B9E;&#x73B0;&#x91CD;&#x7F29;&#x8FDB;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x5229;&#x7528;&#x4E86;&#x7EE7;&#x627F;&#x540E;&#xFF0C;&#x4E5F;&#x53EA;&#x8981;&#x5728;&#x90A3;&#x4E9B;&#x6709;&#x5DEE;&#x5F02;&#x9700;&#x6C42;&#x6587;&#x4EF6;&#x7C7B;&#x578B; &#x4E0A;&#x989D;&#x5916;&#x5904;&#x7406;&#xFF09;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9; Vim &#x7528;&#x7EDF;&#x4E00;&#x7684;&#x4E00;&#x952E;&#x547D;&#x4EE4;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x591A;&#x6001;&#x5E26;&#x6765; &#x7684;&#x4FBF;&#x5229;&#x3002;</p><p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x4E3E;&#x4F8B;&#xFF0C;&#x53EA;&#x662F;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x865A;&#x62DF;&#x793A;&#x4F8B;&#x3002;Vim &#x7F16;&#x7A0B;&#x5668;&#x672C;&#x8EAB;&#x662F;&#x7528; C &#x8BED;&#x8A00;&#x5199;&#x7684;&#xFF0C;&#x5E76;&#x6CA1; &#x6709;&#x7528;&#x5230;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x800C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E3A;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x8BBE;&#x8BA1;&#x4EC0;&#x4E48;&#x7C7B;&#x3002;&#x800C;&#x4E14;&#x65E2;&#x7136;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x5904;&#x7406;&#x6587; &#x672C;&#xFF0C;VimL &#x4E5F;&#x53EA;&#x8981;&#x5904;&#x7406;&#x7B80;&#x5355;&#x7684;&#x6574;&#x6570;&#x4E0E;&#x5B9E;&#x6570;&#xFF08;&#x6D6E;&#x70B9;&#x6570;&#xFF09;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x4F1A;&#x53BB;&#x8BBE;&#x8BA1;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x7684;&#x6570;&#x5B57;&#x7C7B; &#x3002;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x91C7;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x60F3;&#x5206;&#x6790;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x4E0E;&#x89D2;&#x5EA6;&#xFF0C;&#x987A;&#x4FBF;&#x7ED3;&#x5408;&#x793A;&#x4F8B; &#x518D;&#x8BF4;&#x660E;&#x4E0B;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x51E0;&#x4E2A;&#x7279;&#x5F81;&#x3002;</p><h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x4F18;&#x52A3;&#x63D0;&#x793A;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x4F18;&#x52A3;&#x63D0;&#x793A;</h3><p>&#x4E0A;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7531;&#x6B64;&#x5E26;&#x6765;&#x4EE3;&#x7801;&#x6613;&#x7EF4;&#x62A4;&#x6613;&#x7BA1;&#x7406;&#x7684;&#x4F18;&#x70B9;&#x3002;&#x540C;&#x65F6;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E5F;&#x8BF4;&#x660E; &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x8981;&#xFF0C;&#x4E0D;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E5F;&#x80FD;&#x505A;&#x51FA;&#x5F88;&#x597D;&#x7684;&#x5E94;&#x7528;&#x4EA7;&#x54C1;&#x3002;</p><p>&#x5176;&#x5B9E;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E3B;&#x8981;&#x4E0D;&#x662F;&#x9488;&#x5BF9;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x662F;&#x9488;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x8A00;&#x7684;&#x3002;&#x5982;&#x679C;&#x7B80;&#x5355;&#x529F;&#x80FD;&#xFF0C;&#x5355;&#x4EBA;&#x7EF4;&#x62A4;&#xFF0C; &#x5C24;&#x5176;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x529F;&#x80FD;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x4E0D;&#x5FC5;&#x6D89;&#x53CA;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;&#x7684;&#x5C01;&#x88C5;&#x4F1A;&#x589E;&#x52A0;&#x8BB8;&#x591A;&#x590D;&#x6742;&#x4EE3; &#x7801;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x9002;&#x5408;&#x7684;&#x662F;&#x590D;&#x6742;&#x9700;&#x6C42;&#xFF0C;&#x5C24;&#x5176;&#x6D89;&#x53CA;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x6216;&#x9700;&#x8981;&#x957F;&#x671F;&#x7EF4;&#x62A4;&#x7684;&#x9879;&#x76EE;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x5B9E; &#x9645;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x65F6;&#xFF0C;&#x4E5F;&#x8981;&#x6CE8;&#x610F;&#x907F;&#x514D;&#x7C7B;&#x7684;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#xFF0C;&#x589E;&#x52A0;&#x4E0D;&#x5FC5;&#x8981;&#x590D;&#x6742;&#x5EA6;&#x3002;</p><p>&#x672C;&#x7AE0;&#x5269;&#x4E0B;&#x7684;&#x5185;&#x5BB9;&#x65E8;&#x5728;&#x63A2;&#x8BA8;&#x5982;&#x4F55;&#x4F7F;&#x7528; VimL &#x5B9E;&#x73B0;&#x57FA;&#x672C;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3002;&#x4ECE;&#x5B66;&#x4E60;&#x7684;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x4E5F;&#x53EF; &#x636E;&#x6B64;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x4E86;&#x89E3; VimL &#x7684;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x3002;&#x81F3;&#x4E8E;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x4EC0;&#x4E48;&#x6837;&#x7684; Vim &#x529F;&#x80FD;&#x63D2;&#x4EF6;&#x503C;&#x5F97; &#x4F7F;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF0C;&#x90A3;&#x5C31;&#x770B;&#x4E2A;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#x5206;&#x6790;&#x4E0E;&#x4E60;&#x60EF;&#x559C;&#x597D;&#x4E86;&#x3002;</p></section></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div><a href="20170821_6.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 7.2 字典即对象 "><i class="fa fa-angle-right"></i></a></div><script>var gitbook=gitbook||[];gitbook.push(function(){gitbook.page.hasChanged({page:{title:"7.1 面向对象的简介 ",level:"3.4.1",depth:2,next:{title:"7.2 字典即对象 ",level:"3.4.2",depth:2,path:"z/20170821_6.md",ref:"z/20170821_6.md",articles:[]},previous:{title:"第七章 VimL 面向对象编程",level:"3.4",depth:1,ref:"",articles:[{title:"7.1 面向对象的简介 ",level:"3.4.1",depth:2,path:"z/20170821_5.md",ref:"z/20170821_5.md",articles:[]},{title:"7.2 字典即对象 ",level:"3.4.2",depth:2,path:"z/20170821_6.md",ref:"z/20170821_6.md",articles:[]},{title:"7.3 自定义类的组织管理 ",level:"3.4.3",depth:2,path:"z/20170821_7.md",ref:"z/20170821_7.md",articles:[]}]},dir:"ltr"},config:{gitbook:"*",theme:"default",variables:{},plugins:["-sharing","-livereload","prism","-highlight","-lunr","-search","search-plus","copy-code-button","livereload"],pluginsConfig:{prism:{css:["prismjs/themes/prism-okaidia.css"]},links:{sidebar:{"主页":"https://dxsm.github.io/"}},"search-plus":{},"copy-code-button":{},fontsettings:{theme:"white",family:"sans",size:2},"theme-default":{styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"},showLevel:!1}},structure:{langs:"LANGS.md",readme:"README.md",glossary:"GLOSSARY.md",summary:"SUMMARY.md"},pdf:{pageNumbers:!0,fontSize:12,fontFamily:"Arial",paperSize:"a4",chapterMark:"pagebreak",pageBreaksBefore:"/",margin:{right:62,left:62,top:56,bottom:56}},styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"}},file:{path:"z/20170821_5.md",mtime:"2020-05-03T14:38:25.638Z",type:"markdown"},gitbook:{version:"3.2.3",time:"2020-05-03T16:05:40.348Z"},basePath:"..",book:{language:""}})})</script></div><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook.js"></script><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/theme.js"></script><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-search-plus/search.js"></script><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-copy-code-button/toggle.js"></script><script src="https://cdn.jsdelivr.net/gh/dxsm/cdn@1.2.0/gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script></body></html>